"""
1.车头时距的基本概念是指在同一车道上行驶的车辆队列中，前后两辆车的前端通过同一地点的时间差。
2.车头间距，又称为空间车头间距，是指同一车道上行驶的车辆之间，前车车尾与后车车头之间的实际距离。
3.排队长度指路口进口道各转向的排队长度；定义为从路口信号灯转为绿灯时刻，该路口进口道各转向车流排队最后一辆车距离路口停车线的距离。
4.速度，车辆通过有信号灯控制路口时的行车速度。
视频默认30fps，通过frame_id可以计算得到视频的时长
"""

import math
import numpy as np
import cv2


# 计算两点之间的距离
def calculate_distance(point1, point2):
    """
    计算两个像素点之间的欧几里得距离。

    参数:
    point1 (tuple): 第一个点的坐标，格式为(x1, y1)。
    point2 (tuple): 第二个点的坐标，格式为(x2, y2)。

    返回:
    float: 两点之间的距离。
    """
    x1, y1 = point1
    x2, y2 = point2
    distance = math.sqrt((x2 - x1) ** 2 + (y2 - y1) ** 2)
    return distance


# 通过多边形得到掩码矩阵
def get_mask(h, w, mask_pt: list):
    # 创建图像
    img = np.zeros((h, w, 1), np.uint8)
    # 遍历每一根多段线
    for pl in mask_pt:
        pl = np.array(pl)
        pl[:, 0] = np.round(pl[:, 0] * w)  # x
        pl[:, 1] = np.round(pl[:, 1] * h)  # y

        # 绘制多边形
        cv2.polylines(img, [np.array(pl, dtype=np.int32)], True, 1)
        # 获取掩码
        img = cv2.fillPoly(img, [np.array(pl, dtype=np.int32)], 1)

    # cv2.imshow('Mask Image', img)
    # cv2.waitKey(0)
    # cv2.destroyAllWindows()
    return img


# 计算车头时距
# 车头时距的基本概念是指在同一车道上行驶的车辆队列中，”前后两辆车“的”前端“通过同一地点的时间差。
# 车子前面没车子的话，取得值是固定值2.3s
def calculate_headway_times(tracks, length_per_pixel):
    # 需要知道前一辆车的位置在哪
    pass


# 车头间距
# 车头间距，又称为空间车头间距，是指同一车道上行驶的车辆之间（进入出口道），”前车车头“与”后车车头“之间的实际距离。
def calculate_headway_distances(tracks, length_per_pixel):
    # 需要知道前一辆车的位置在哪
    pass


# 排队长度
# 排队长度指路口进口道各转向的排队长度；定义为从路口信号灯转为绿灯时刻，该路口进口道各转向车流排队最后一辆车距离路口停车线的距离。
def calculate_queue_length(tracks, length_per_pixel):
    # 需要判断车辆在什么情况处于排队状态
    # 需要知道停止线的位置
    pass


# 速度
# 速度可以通过计算车辆在连续两帧之间的移动距离除以时间差来计算。
def calculate_speed(tracks, length_per_pixel):
    pass


# ---------------第一组测试数据---------------
# 读取的result.txt数据
txt_path = r'example\1_result.txt'
# 画面尺寸
w, h = (1920, 1080)

mask = []  # 车道区域
scale_line = [[0.4934539794921875, 0.2621527777777778], [0.5608367919921875, 0.265625]]  # 比例尺线
scale_length = 4 * 3.5  # 比例尺的实际尺寸，以m为单位
entrance_areas = [[[0.4446258544921875, 0.2708333333333333], [0.4631805419921875, 0.2934027777777778],
                   [0.4905242919921875, 0.2604166666666667], [0.5618133544921875, 0.2621527777777778],
                   [0.5657196044921875, 0.001736111111111111], [0.4856414794921875, 0.001736111111111111],
                   [0.4622039794921875, 0.203125]],
                  [[0.0012664794921875, 0.5503472222222222], [0.4114227294921875, 0.5451388888888888],
                   [0.4163055419921875, 0.6927083333333334], [0.4006805419921875, 0.7239583333333334],
                   [0.3840789794921875, 0.7534722222222222], [0.3186492919921875, 0.7291666666666666],
                   [0.0950164794921875, 0.7413194444444444], [0.0032196044921875, 0.7361111111111112]],
                  [[0.5129852294921875, 0.8003472222222222], [0.5862274169921875, 0.8020833333333334],
                   [0.6086883544921875, 0.7986111111111112], [0.6233367919921875, 0.8315972222222222],
                   [0.6096649169921875, 0.8819444444444444], [0.6018524169921875, 0.953125],
                   [0.6038055419921875, 0.9930555555555556], [0.5120086669921875, 0.9930555555555556]],
                  [[0.6448211669921875, 0.3975694444444444], [0.6565399169921875, 0.3576388888888889],
                   [0.6721649169921875, 0.3333333333333333], [0.9993133544921875, 0.3611111111111111],
                   [0.9983367919921875, 0.5138888888888888], [0.9534149169921875, 0.5190972222222222],
                   [0.6516571044921875, 0.5243055555555556]]]  # 进口道区域
stop_lines = [
    [[0.4456024169921875, 0.2690972222222222], [0.4582977294921875, 0.296875],
     [0.4934539794921875, 0.2638888888888889], [0.5579071044921875, 0.2621527777777778]],
    [[0.6731414794921875, 0.3333333333333333], [0.6575164794921875, 0.359375],
     [0.6448211669921875, 0.3975694444444444], [0.6526336669921875, 0.5190972222222222]],
    [[0.6243133544921875, 0.8315972222222222], [0.6086883544921875, 0.8020833333333334],
     [0.5139617919921875, 0.7986111111111112]],
    [[0.3791961669921875, 0.75], [0.3977508544921875, 0.7239583333333334],
     [0.4133758544921875, 0.6944444444444444], [0.4094696044921875, 0.5434027777777778]]]  # 停止线位置

# ---------------第二组测试数据---------------
# 读取的result.txt数据
txt_path = r'example\5_result.txt'
# 画面尺寸
w, h = (3810, 2160)

mask = []  # 车道区域
scale_line = [[0.4407196044921875, 0.2517361111111111], [0.5139617919921875, 0.2534722222222222]]  # 比例尺线
scale_length = 5 * 3.5  # 比例尺的实际尺寸，以m为单位
entrance_areas = [[[0.4368133544921875, 0], [0.4368133544921875, 0.2482638888888889],
                   [0.5149383544921875, 0.25], [0.5129852294921875, 0]],
                  [[0.6838836669921875, 0.4565972222222222], [0.6838836669921875, 0.5677083333333334],
                   [0.9973602294921875, 0.5763888888888888], [0.9963836669921875, 0.4739583333333333]],
                  [[0.5276336669921875, 0.8125], [0.6125946044921875, 0.828125],
                   [0.6155242919921875, 0.9930555555555556], [0.5276336669921875, 0.9965277777777778]],
                  [[0.0002899169921875, 0.5347222222222222], [0.1321258544921875, 0.5225694444444444],
                   [0.3791961669921875, 0.5434027777777778], [0.3762664794921875, 0.6527777777777778],
                   [0.0017547607421875, 0.6145833333333334]]]  # 进口道区域
stop_lines = [[[0.4407196044921875, 0.2517361111111111], [0.5139617919921875, 0.2534722222222222]],
              [[0.6858367919921875, 0.421875], [0.6838836669921875, 0.5677083333333334]],
              [[0.6223602294921875, 0.8263888888888888], [0.5256805419921875, 0.8107638888888888]],
              [[0.3752899169921875, 0.6805555555555556], [0.3782196044921875, 0.5486111111111112]]]  # 停止线位置

# ------------------------------------------
# 去归一化，并转为numpy格式，方便计算
scale_line = np.array(scale_line) * np.array((w, h))
if len(scale_line) != 0 and scale_length:
    distance = calculate_distance(scale_line[0], scale_line[1])
    # 计算得到一个像素代表的实际真实长度（以m为单位）
    length_per_pixel = scale_length / distance
    print(length_per_pixel)

# 读取result_txt的数据，进行后续处理
with open(txt_path, 'r') as f:
    lines = f.readlines()
# 新建一个轨迹列表把这些数据储存起来
tracks = []
# 遍历txt每一行数据
for line in lines:
    info_list = line.replace('\n', '').split(',')
    # todo: 这里数量可能会继续变多
    # 获取属性里的每一个值
    frame, id, x1, y1, x2, y2, conf, cls, track_cls = info_list
    # 修改内部参数的属性并赋值道track中
    track = [int(frame), int(id), int(x1), int(y1), int(x2), int(y2), float(conf), int(cls), int(track_cls)]
    tracks.append(track)

get_mask(h, w, entrance_areas)

print(tracks)
